In [120]:
import pandas as pd
import numpy as np
seri = pd.Series([1,2,3,4,5,6,7,8,9])

In [121]:
print(seri)
print(seri.axes)
print(seri.size)
print(seri.ndim)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64
[RangeIndex(start=0, stop=9, step=1)]
9
1

In [122]:
print(seri.values)
print(seri.head()) # default olarak içinde 5 değeri var 10 girersen ilk 10 değeri gösterecektir
print(seri.tail(3)) # buda sondaki değerleri gösteriyor

[1 2 3 4 5 6 7 8 9]
0    1
1    2
2    3
3    4
4    5
dtype: int64
6    7
7    8
8    9
dtype: int64

In [123]:
yeni_seri = pd.Series([22,33,44,55,66], index=["a","b","c","d","e"])
print(yeni_seri)
print(yeni_seri["a"])
print(yeni_seri["a":"c"])

a    22
b    33
c    44
d    55
e    66
dtype: int64
22
a    22
b    33
c    44
dtype: int64

In [124]:
sözlük = { "reg":10,"log":12,"cart":23}
seri_szlk = pd.Series(sözlük)
print(seri_szlk)

reg     10
log     12
cart    23
dtype: int64

In [125]:
l = [1,2,3,4]
pd.DataFrame(l,columns=["bal"])

   bal
0    1
1    2
2    3
3    4

In [126]:
s1 = np.random.randint(0,10,size=5)
s2 = np.random.randint(0,10,size=5)
s3 = np.random.randint(0,10,size=5)
sozluk = {"a":s1,"b":s2,"c":s3}
df = pd.DataFrame(sozluk)
df

   a  b  c
0  3  3  6
1  6  2  6
2  6  1  0
3  0  1  3
4  6  5  9

In [127]:
df[1:3]

   a  b  c
1  6  2  6
2  6  1  0

In [128]:
df.drop(4, axis=0) # kalıcı değil
# df.drop(4,axis=0,inplace=True) == inplace'i kullanarak silme işlemini kalıcı yapabilirsin

   a  b  c
0  3  3  6
1  6  2  6
2  6  1  0
3  0  1  3

In [129]:
m = np.random.randint(1,30,size=(5,3))
df = pd.DataFrame(m, columns=["var1","var2","var3"])
print(df)
print(df.loc[1:3])
print(df.iloc[1:3])

   var1  var2  var3
0    21    26    18
1    21    13    13
2     8     8    17
3    14     7    23
4    21    26    25
   var1  var2  var3
1    21    13    13
2     8     8    17
3    14     7    23
   var1  var2  var3
1    21    13    13
2     8     8    17

In [130]:
print(df[df.var1 > 10])
print("*"*10)
print(df.loc[(df.var1 < 15) & (df.var3 > 15) , "var2"])
print("*"*10)
print(df.query("var1 < 15 & var3 > 15"))

   var1  var2  var3
0    21    26    18
1    21    13    13
3    14     7    23
4    21    26    25
**********
2    8
3    7
Name: var2, dtype: int32
**********
   var1  var2  var3
2     8     8    17
3    14     7    23

In [132]:
df2 = df + 99
df2

   var1  var2  var3
0   120   125   117
1   120   112   112
2   107   107   116
3   113   106   122
4   120   125   124

In [134]:
pd.concat([df,df2], ignore_index=True)

   var1  var2  var3
0    21    26    18
1    21    13    13
2     8     8    17
3    14     7    23
4    21    26    25
5   120   125   117
6   120   112   112
7   107   107   116
8   113   106   122
9   120   125   124